<a href="https://colab.research.google.com/github/Pawansansanwal/Assignment/blob/master/Pandas_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame({'From_To':['LoNDon_paris','MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis','Brussels_londOn'],
                 'FlightNumber':[10045,np.nan,10065,np.nan,10085],'RecentDelays':[[23,47],[],[24,43,87],[13],[67,32]],'Airline':['KLM(!)','<Air France>(12)','(British Airways.)','12.Air France',"'Swiss Air'"]})

In [3]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)

In [4]:
df

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris         10045      [23, 47]              KLM(!)
1      MAdrid_miLAN         10055            []    <Air France>(12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways.)
3    Budapest_PaRis         10075          [13]       12.Air France
4   Brussels_londOn         10085      [67, 32]         'Swiss Air'

In [5]:
df['From'] = [i.split('_')[0] for i in df['From_To']]
df['To'] = [i.split('_')[1] for i in df['From_To']]

In [6]:
df.drop('From_To',axis = 1, inplace=True)

In [7]:
df

   FlightNumber  RecentDelays             Airline      From         To
0         10045      [23, 47]              KLM(!)    LoNDon      paris
1         10055            []    <Air France>(12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways.)    londON  StockhOlm
3         10075          [13]       12.Air France  Budapest      PaRis
4         10085      [67, 32]         'Swiss Air'  Brussels     londOn

In [8]:
df['From'] = df['From'].str.capitalize()
df['To'] = df['To'].str.capitalize()

In [9]:
df

   FlightNumber  RecentDelays             Airline      From         To
0         10045      [23, 47]              KLM(!)    London      Paris
1         10055            []    <Air France>(12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways.)    London  Stockholm
3         10075          [13]       12.Air France  Budapest      Paris
4         10085      [67, 32]         'Swiss Air'  Brussels     London

In [10]:
delays = pd.DataFrame(df['RecentDelays'])

In [12]:
delays = delays['RecentDelays'].apply(pd.Series)

In [13]:
delays = delays.rename(columns =(lambda x: 'Delays_' +str(x)))

In [14]:
delays

   Delays_0  Delays_1  Delays_2
0      23.0      47.0       NaN
1       NaN       NaN       NaN
2      24.0      43.0      87.0
3      13.0       NaN       NaN
4      67.0      32.0       NaN